{"value":[{"id":"/subscriptions/f96dc016-5a6b-4b65-ad3b-fe5344e28c3d/resourceGroups/rg-rd-hub-p/providers/Microsoft.OperationalInsights/workspaces/law-rd-hub-p01/providers/Microsoft.SecurityInsights/alertRules/BuiltInFusion","name":"BuiltInFusion","etag":"\"0700fdd8-0000-0a00-0000-6512f3ec0000\"","type":"Microsoft.SecurityInsights/alertRules","kind":"Fusion","properties":{"displayName":"Advanced Multistage Attack Detection","description":"Microsoft Sentinel uses Fusion, a correlation engine based on scalable machine learning algorithms, to automatically detect multistage attacks by identifying combinations of anomalous behaviors and suspicious activities that are observed at various stages of the kill chain. On the basis of these discoveries, Azure Sentinel generates incidents that would otherwise be very difficult to catch. By design, these incidents are low-volume, high-fidelity, and high-severity, which is why this detection is turned ON by default.\n\nSince Fusion correlates multiple signals from various products to detect advanced multistage attacks, successful Fusion detections are presented as Fusion incidents on the Microsoft Sentinel Incidents page. This rule covers the following detections:\n- Fusion for emerging threats\n- Fusion for ransomware\n- Scenario-based Fusion detections (122 scenarios)\n\nTo enable these detections, we recommend you configure the following data connectors for best results:\n- Out-of-the-box anomaly detections\n- Azure Active Directory Identity Protection\n- Azure Defender\n- Azure Defender for IoT\n- Microsoft 365 Defender\n- Microsoft Cloud App Security    \n- Microsoft Defender for Endpoint\n- Microsoft Defender for Identity\n- Microsoft Defender for Office 365\n- Scheduled analytics rules, both built-in and those created by your security analysts. Analytics rules must contain kill-chain (tactics) and entity mapping information in order to be used by Fusion.\n\nFor the full description of each detection that is supported by Fusion, go to https://aka.ms/SentinelFusion.","alertRuleTemplateName":"f71aba3d-28fb-450b-b192-4e76a83015c8","tactics":["Collection","CommandAndControl","CredentialAccess","DefenseEvasion","Discovery","Execution","Exfiltration","Impact","InitialAccess","LateralMovement","Persistence","PrivilegeEscalation"],"severity":"High","techniques":[],"enabled":true,"lastModifiedUtc":"2023-09-26T15:08:28.8808132Z"}},{"id":"/subscriptions/f96dc016-5a6b-4b65-ad3b-fe5344e28c3d/resourceGroups/rg-rd-hub-p/providers/Microsoft.OperationalInsights/workspaces/law-rd-hub-p01/providers/Microsoft.SecurityInsights/alertRules/12913cbd-ceb2-40c8-b336-6c8635f70cbb","name":"12913cbd-ceb2-40c8-b336-6c8635f70cbb","etag":"\"0000b36b-0000-0a00-0000-6513dab10000\"","type":"Microsoft.SecurityInsights/alertRules","kind":"Scheduled","properties":{"queryFrequency":"P1D","queryPeriod":"P1D","triggerOperator":"GreaterThan","triggerThreshold":0,"eventGroupingSettings":{"aggregationKind":"SingleAlert"},"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":false,"reopenClosedIncident":false,"lookbackDuration":"PT5H","matchingMethod":"AllEntities","groupByEntities":[],"groupByAlertDetails":[],"groupByCustomDetails":[]}},"templateVersion":"2.0.2","severity":"Low","query":"let match_window = 3m;\nAzureActivity\n| where ResourceGroup has \"cloud-shell\"\n| where (OperationNameValue =~ \"Microsoft.Storage/storageAccounts/listKeys/action\")\n| where ActivityStatusValue =~ \"Success\"\n| extend TimeKey = bin(TimeGenerated, match_window), AzureIP = CallerIpAddress\n| join kind = inner\n(AzureActivity\n| where ResourceGroup has \"cloud-shell\"\n| where (OperationNameValue =~ \"Microsoft.Storage/storageAccounts/write\")\n| extend TimeKey = bin(TimeGenerated, match_window), UserIP = CallerIpAddress\n) on Caller, TimeKey\n| summarize count() by TimeKey, Caller, ResourceGroup, SubscriptionId, TenantId, AzureIP, UserIP, HTTPRequest, Type, Properties, CategoryValue, OperationList = strcat(OperationNameValue, ' , ', OperationNameValue1)\n| extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])\n","suppressionDuration":"PT1H","suppressionEnabled":false,"tactics":["Execution"],"techniques":["T1059"],"displayName":"New CloudShell User","enabled":true,"description":"Identifies when a user creates an Azure CloudShell for the first time.\nMonitor this activity to ensure only the expected users are using CloudShell.","alertRuleTemplateName":"6d7214d9-4a28-44df-aafb-0910b9e6ae3e","lastModifiedUtc":"2023-09-27T07:33:02.9581142Z"}},{"id":"/subscriptions/f96dc016-5a6b-4b65-ad3b-fe5344e28c3d/resourceGroups/rg-rd-hub-p/providers/Microsoft.OperationalInsights/workspaces/law-rd-hub-p01/providers/Microsoft.SecurityInsights/alertRules/ef69e78d-2414-4b19-a66b-ec0dc113b5be","name":"ef69e78d-2414-4b19-a66b-ec0dc113b5be","etag":"\"0000676c-0000-0a00-0000-6513daec0000\"","type":"Microsoft.SecurityInsights/alertRules","kind":"Scheduled","properties":{"queryFrequency":"P1D","queryPeriod":"P1D","triggerOperator":"GreaterThan","triggerThreshold":1,"eventGroupingSettings":{"aggregationKind":"SingleAlert"},"incidentConfiguration":{"createIncident":true,"groupingConfiguration":{"enabled":false,"reopenClosedIncident":false,"lookbackDuration":"PT5H","matchingMethod":"AllEntities","groupByEntities":[],"groupByAlertDetails":[],"groupByCustomDetails":[]}},"templateVersion":"2.0.1","severity":"Low","query":"let tokens = dynamic([\"416\",\"208\",\"192\",\"128\",\"120\",\"96\",\"80\",\"72\",\"64\",\"48\",\"44\",\"40\",\"g5\",\"gs5\",\"g4\",\"gs4\",\"nc12\",\"nc24\",\"nv24\"]);\nlet operationList = dynamic([\"microsoft.compute/virtualmachines/write\", \"microsoft.resources/deployments/write\"]);\nAzureActivity\n| where OperationNameValue in~ (operationList)\n| where ActivityStatusValue startswith \"Accept\"\n| where Properties has 'vmSize'\n| extend parsed_property= parse_json(tostring((parse_json(Properties).responseBody))).properties\n| extend vmSize = tostring((parsed_property.hardwareProfile).vmSize)\n| where vmSize has_any (tokens)\n| extend ComputerName = tostring((parsed_property.osProfile).computerName)\n| project TimeGenerated, OperationNameValue, ActivityStatusValue, Caller, CallerIpAddress, ComputerName, vmSize\n| extend Name = tostring(split(Caller,'@',0)[0]), UPNSuffix = tostring(split(Caller,'@',1)[0])\n","suppressionDuration":"PT1H","suppressionEnabled":false,"tactics":["DefenseEvasion"],"techniques":["T1578"],"displayName":"Creation of expensive computes in Azure","enabled":true,"description":"Identifies the creation of large size or expensive VMs (with GPUs or with a large number of virtual CPUs) in Azure.\nAn adversary may create new or update existing virtual machines to evade defenses or use them for cryptomining purposes.\nFor Windows/Linux Vm Sizes, see https://docs.microsoft.com/azure/virtual-machines/windows/sizes \nAzure VM Naming Conventions, see https://docs.microsoft.com/azure/virtual-machines/vm-naming-conventions","alertRuleTemplateName":"9736e5f1-7b6e-4bfb-a708-e53ff1d182c3","lastModifiedUtc":"2023-09-27T07:34:03.6695127Z"}}]}